{
  "architectures": [
    "CamembertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "classifier_dropout": null,
  "eos_token_id": 6,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": 44571,
    "1": 104000,
    "2": 131000,
    "3": 165000,
    "4": 203000,
    "5": 207000,
    "6": 215000,
    "7": 261000,
    "8": 270000,
    "9": 455000,
    "10": 467000,
    "11": 531000,
    "12": 601000,
    "13": 602000,
    "14": 604000,
    "15": 606400,
    "16": 613500,
    "17": 614000,
    "18": 616000,
    "19": 618000,
    "20": 621000,
    "21": 622000,
    "22": 623000,
    "23": 624100,
    "24": 625000,
    "25": 625100,
    "26": 625200,
    "27": 625300,
    "28": 631300,
    "29": 635000,
    "30": 641000,
    "31": 645000,
    "32": 645800,
    "33": 647000,
    "34": 654000,
    "35": 666000,
    "36": 671000,
    "37": 675000,
    "38": 706000,
    "39": 756000,
    "40": 758000,
    "41": 775000,
    "42": 790000
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "44571": 0,
    "104000": 1,
    "131000": 2,
    "165000": 3,
    "203000": 4,
    "207000": 5,
    "215000": 6,
    "261000": 7,
    "270000": 8,
    "455000": 9,
    "467000": 10,
    "531000": 11,
    "601000": 12,
    "602000": 13,
    "604000": 14,
    "606400": 15,
    "613500": 16,
    "614000": 17,
    "616000": 18,
    "618000": 19,
    "621000": 20,
    "622000": 21,
    "623000": 22,
    "624100": 23,
    "625000": 24,
    "625100": 25,
    "625200": 26,
    "625300": 27,
    "631300": 28,
    "635000": 29,
    "641000": 30,
    "645000": 31,
    "645800": 32,
    "647000": 33,
    "654000": 34,
    "666000": 35,
    "671000": 36,
    "675000": 37,
    "706000": 38,
    "756000": 39,
    "758000": 40,
    "775000": 41,
    "790000": 42
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32005
}
